build/resources/gatling/soapregisterwithtoken/0000_request.dat

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
 	<S:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:BinarySecurityToken QualificationValueType="http://schemas.emc.com/documentum#ResourceAccessToken" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="RAD">eyJhbGciOiJSUzI1NiIsImtpZCI6Ilg1ZVhrNHh5b2pORnVtMWtsMll0djhkbE5QNC1jNTdkTzZRR1RWQndhTmsiLCJ0eXAiOiJKV1QifQ.eyJpZHAiOiJMb2NhbEFjY291bnQiLCJvaWQiOiI0YjUzNDQxNy0wOWQ2LTRjMWMtYTRkMy1kYjcyNjdjYTk3MTciLCJzdWIiOiI0YjUzNDQxNy0wOWQ2LTRjMWMtYTRkMy1kYjcyNjdjYTk3MTciLCJnaXZlbl9uYW1lIjoiWGhpYml0IiwiZmFtaWx5X25hbWUiOiJFeHRlcm5hbCB1c2VyIiwidGZwIjoiQjJDXzFfcm9wY19kYXJ0c19zaWduaW4iLCJzY3AiOiJEYXJ0cy5FeHRlcm5hbFNlcnZpY2UiLCJhenAiOiIzNjNjMTFjYi00OGI5LTQ0YmYtOWQwNi05YTM5NzNmNmY0MTMiLCJ2ZXIiOiIxLjAiLCJpYXQiOjE3MDkxMjY3NDAsImF1ZCI6IjM2M2MxMWNiLTQ4YjktNDRiZi05ZDA2LTlhMzk3M2Y2ZjQxMyIsImV4cCI6MTcwOTEzMDM0MCwiaXNzIjoiaHR0cHM6Ly9obWN0c3N0Z2V4dGlkLmIyY2xvZ2luLmNvbS84YjE4NWY4Yi02NjVkLTRiYjMtYWY0YS1hYjdlZTYxYjkzMzQvdjIuMC8iLCJuYmYiOjE3MDkxMjY3NDB9.HiUSd4a3rHoAfrLBc6wRsYOIca9lCqhZXChciI6BI8rCkB1MHC6BN9YKYMfQzizW97CCc9PnxvVSUreM6YqpA5ry3okSoiA_Spofbi0J8gypulKSu6kgQk5ladqIFInrjVfOIV8ZvbTWJmGQfwfKp3nXraX6iNxU8jlshD0V81ig2gDtQ9FyxRhYrSFP__nKwzBjGQfDkBgPHrAtwYt1IkwwM-KZoFrGUebzl6N8hN7uSRELVLw8AuwRatPOBRIVUwDCoEC-HOiBmY3it8_ZfJDh7DG9JcmOUNGr-31mKEOM8btWEQpI02krNVRerJCpjAnU6z-jodYYOulGnOmIqQ</wsse:BinarySecurityToken></wsse:Security>
   	</S:Header>
   	<S:Body>
     <ns8:register xmlns:ns8="http://services.rt.fs.documentum.emc.com/" xmlns:ns7="http://core.datamodel.fs.documentum.emc.com/" xmlns:ns6="http://content.core.datamodel.fs.documentum.emc.com/" xmlns:ns5="http://query.core.datamodel.fs.documentum.emc.com/" xmlns:ns4="http://profiles.core.datamodel.fs.documentum.emc.com/" xmlns:ns3="http://properties.core.datamodel.fs.documentum.emc.com/" xmlns:ns2="http://context.core.datamodel.fs.documentum.emc.com/">
         <context>
            <ns2:Identities xsi:type="ns2:RepositoryIdentity" repositoryName="moj_darts" password="l0g1c@" userName="xhibit_ws_user" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"></ns2:Identities>
            <ns2:Profiles xsi:type="ns4:ContentTransferProfile" isProcessOLELinks="false" allowAsyncContentTransfer="false" allowCachedContentTransfer="false" transferMode="MTOM" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"></ns2:Profiles>
         </context>
         <host>http://localhost:8070/service/darts/</host>
     </ns8:register>
   </S:Body>
</S:Envelope>